         DEFINE TRANSACTION(CA00)
                GROUP(CARDDEMO)
                PROGRAM(COADM01C)
                TWASIZE(0)
                PROFILE(DFHCICST)
                STATUS(ENABLED)

         DEFINE TRANSACTION(CM00)
                GROUP(CARDDEMO)
                PROGRAM(COMEN01C)
                TWASIZE(0)
                PROFILE(DFHCICST)
                STATUS(ENABLED)

         DEFINE TRANSACTION(CD00)
                GROUP(CARDDEMO)
                PROGRAM(CODASH00C)
                TWASIZE(0)
                PROFILE(DFHCICST)
                STATUS(ENABLED)

         DEFINE TRANSACTION(CC00)
                GROUP(CARDDEMO)
                PROGRAM(COSGN00C)
                TWASIZE(0)
                PROFILE(DFHCICST)
                STATUS(ENABLED)

         DEFINE TRANSACTION(CAVW)
                GROUP(CARDDEMO)
                PROGRAM(COACTVWC)
                TWASIZE(0)
                PROFILE(DFHCICST)
                STATUS(ENABLED)

         DEFINE TRANSACTION(CAUP)
                GROUP(CARDDEMO)
                PROGRAM(COACTUPC)
                TWASIZE(0)
                PROFILE(DFHCICST)
                STATUS(ENABLED)

         DEFINE PROGRAM(COADM01C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COMEN01C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(CODASH00C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COSGN00C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COACTVWC)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COACTUPC)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COBIL00C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COCRDLIC)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COCRDSLC)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COCRDUPC)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COPAUS0C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(CORPT00C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COTRN00C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COTRN01C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COTRN02C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COTRTLIC)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COTRTUPC)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COUSR00C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COUSR01C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COUSR02C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE PROGRAM(COUSR03C)
                GROUP(CARDDEMO)
                LANGUAGE(COBOL)
                RELOAD(NO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE MAPSET(COADM1A)
                GROUP(CARDDEMO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE MAPSET(COMEN1A)
                GROUP(CARDDEMO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE MAPSET(CODASH00)
                GROUP(CARDDEMO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE MAPSET(CACTVWA)
                GROUP(CARDDEMO)
                RESIDENT(NO)
                STATUS(ENABLED)

         DEFINE FILE(ACCTDAT)
                GROUP(CARDDEMO)
                DSNAME(AWS.M2.CARDDEMO.ACCTDATA.VSAM.KSDS)
                RLSACCESS(NO)
                REMOTESYSTEM()
                REMOTENAME()
                KEYLENGTH(11)
                RECORDSIZE(300)
                RECORDFORMAT(FIXED)
                STRINGS(1)
                LSRPOOLID(1)
                READINTEG(UNCOMMITTED)
                DSNSHARING(ALLREQS)
                BLOCKFORMAT(UNBLOCKED)
                STATUS(ENABLED)
                OPENTIME(FIRSTREF)
                DISPOSITION(SHARE)
                DATABUFFERS(2)
                INDEXBUFFERS(1)
                TABLE(NO)
                MAXNUMRECS(NOLIMIT)
                UPDATEMODEL(LOCKING)
                ADD(YES)
                BROWSE(YES)
                DELETE(YES)
                READ(YES)
                UPDATE(YES)

         DEFINE FILE(CUSTDAT)
                GROUP(CARDDEMO)
                DSNAME(AWS.M2.CARDDEMO.CUSTDATA.VSAM.KSDS)
                RLSACCESS(NO)
                REMOTESYSTEM()
                REMOTENAME()
                KEYLENGTH(9)
                RECORDSIZE(500)
                RECORDFORMAT(FIXED)
                STRINGS(1)
                LSRPOOLID(1)
                READINTEG(UNCOMMITTED)
                DSNSHARING(ALLREQS)
                BLOCKFORMAT(UNBLOCKED)
                STATUS(ENABLED)
                OPENTIME(FIRSTREF)
                DISPOSITION(SHARE)
                DATABUFFERS(2)
                INDEXBUFFERS(1)
                TABLE(NO)
                MAXNUMRECS(NOLIMIT)
                UPDATEMODEL(LOCKING)
                ADD(YES)
                BROWSE(YES)
                DELETE(YES)
                READ(YES)
                UPDATE(YES)

         DEFINE FILE(USRSEC)
                GROUP(CARDDEMO)
                DSNAME(AWS.M2.CARDDEMO.USRSEC.VSAM.KSDS)
                RLSACCESS(NO)
                REMOTESYSTEM()
                REMOTENAME()
                KEYLENGTH(8)
                RECORDSIZE(80)
                RECORDFORMAT(FIXED)
                STRINGS(1)
                LSRPOOLID(1)
                READINTEG(UNCOMMITTED)
                DSNSHARING(ALLREQS)
                BLOCKFORMAT(UNBLOCKED)
                STATUS(ENABLED)
                OPENTIME(FIRSTREF)
                DISPOSITION(SHARE)
                DATABUFFERS(2)
                INDEXBUFFERS(1)
                TABLE(NO)
                MAXNUMRECS(NOLIMIT)
                UPDATEMODEL(LOCKING)
                ADD(YES)
                BROWSE(YES)
                DELETE(YES)
                READ(YES)
                UPDATE(YES)

         DEFINE FILE(CXACAIX)
                GROUP(CARDDEMO)
                DSNAME(AWS.M2.CARDDEMO.CARDXREF.VSAM.KSDS)
                RLSACCESS(NO)
                REMOTESYSTEM()
                REMOTENAME()
                KEYLENGTH(16)
                RECORDSIZE(50)
                RECORDFORMAT(FIXED)
                STRINGS(1)
                LSRPOOLID(1)
                READINTEG(UNCOMMITTED)
                DSNSHARING(ALLREQS)
                BLOCKFORMAT(UNBLOCKED)
                STATUS(ENABLED)
                OPENTIME(FIRSTREF)
                DISPOSITION(SHARE)
                DATABUFFERS(2)
                INDEXBUFFERS(1)
                TABLE(NO)
                MAXNUMRECS(NOLIMIT)
                UPDATEMODEL(LOCKING)
                ADD(NO)
                BROWSE(YES)
                DELETE(NO)
                READ(YES)
                UPDATE(NO)

         CEDA INSTALL GROUP(CARDDEMO)